Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetLocalCoordinateSystem(Autodesk.Revit.DB.XYZ)
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
point:
The point on the analytical model surface element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when called with point that not lie on the analytical model surface element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.SetLoops(Autodesk.Revit.DB.Structure.AnalyticalLoopType,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Set new analytical model geometry (newLoops) for analytical surface elements such as floors and slabs.
Remarks:
Analytical surface will be automatically generated from provided newLoops.
Number of newLoops and number of curves in each newloop have to correspond to loops number with the same loopType in element.
To verify number of loops and their type use getLoops method.
Currently you can not set arbitrary shape for analytical walls. For walls false will be returned.
loopType:
Determine what kind of loops will be set. Rest of loops remain unchanged.
newLoops:
New analytical geometry for analytical surface elements.
Returns:
False if setting the new location failed for one or more curves. True if setting new location succeeded for all curves.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when number of newLoops is different from number of current loops considering loopType.
-or-
Thrown when number of curves in each loop in newLoop don't correspond to number of curves in current loop.
-or-
Thrown when type of curves in newLoop differ from number of curves in current loop (eg. line changed to arc).
-or-
Thrown when length of any curve in newLoops is invalid.
-or-
Thrown when new loops intersect themselves or intersect with loops already set in analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetLoops(Autodesk.Revit.DB.Structure.AnalyticalLoopType)
Retrieves Analytical Model Loops with respect to the loopType.
Remarks:
For multiple concentric loops, only the outermost loop will be considered External. All other loops will be considered Internal.
Returns:
Loops that satisfy loopType criteria are returned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.ShowOpening(Autodesk.Revit.DB.ElementId)
Shows previously hidden set of curves originating from Opening.
openingId:
Opening to show in analytical surface.
Returns:
True if given opening was shown (operation was successful).
Throws Autodesk.Revit.Exceptions.ArgumentException:
openingId is invalid for Analytical Model Surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.IsOpeningHidden(Autodesk.Revit.DB.ElementId)
Returns true if opening with given Identifier is hidden.
openingId:
Identifier of opening to check.
Returns:
True for openings which are hidden, false for all other Identifiers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HideOpening(Autodesk.Revit.DB.ElementId)
Hides set of curves originating from Opening.
openingId:
Opening to hide in analytical surface.
Returns:
True if given opening was hidden (operation was successful).
Throws Autodesk.Revit.Exceptions.ArgumentException:
openingId is invalid for Analytical Model Surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasOpenings
Checks if the analytical model surface have any openings.
Returns:
True if Analytical Surface Element contains any openings (included invalid for hide).
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetOpeningLoops(Autodesk.Revit.DB.ElementId)
Retrieves Array of CurveLoops of Analytical Surface Opening..
Only valid openings for hide are allowed.
openingId:
Identifies which Opening creates the CurveLoop in the analytical surface.
Returns:
Array of CurveLoops associated with Opening.
Throws Autodesk.Revit.Exceptions.ArgumentException:
openingId is invalid for Analytical Model Surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetOpenings(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId}@)
Retrieves Analytical Surface Openings Identifiers valid to be used in showOpening/hideOpening functions.
openingsIds:
Set of openings Identifiers in Analytical Surface Element which are valid for hide.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetHiddenOpenings(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId}@)
Retrieves Identifiers of all hidden openings.
openingsIds:
Set of openings Identifiers which are hidden in Analytical Surface Element.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.IsValidOpeningForHide(Autodesk.Revit.DB.ElementId)
Returns true if opening with given Identifier could be hidden, false for all other Identifiers.
openingId:
Identifier of opening to check.
Returns:
True for openings which are valid to be hidden, false for all other Identifiers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetPlane
Returns plane on which Analytical Model Surface Element is lying.
Only planar surface elements are valid for this function.
Returns:
Plane object on which Analytical Model is projected.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModelSurface is not a planar object.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.IsPlanar
Indicates if the Analytical Model Surface Element is planar.
Returns:
True if Analytical Model Surface Element is planar, false otherwise.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.TopExtensionPlaneId
The top extension plane ID option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
This Plane identifies a Level, a Grid, or a Ref Plane.
To validate plane use Autodesk::Revit::DB::Structure::AnalyticalModelSurface::isPlaneValidForExtension method.
To chcek if analytical model support extension use Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension property.
If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.BottomExtensionPlaneId
The bottom extension plane ID option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
This Plane identifies a Level, a Grid, or a Ref Plane.
To validate plane use Autodesk::Revit::DB::Structure::AnalyticalModelSurface::isPlaneValidForExtension method.
To chcek if analytical model support extension use Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension property.
If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.TopExtension
The top extension option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
To chcek if analytical model support extension use Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.BottomExtension
The bottom extension option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
To chcek if analytical model support extension use Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.BottomExtensionMethod
The bottom extension method option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
To chcek if analytical model support extension use Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.TopExtensionMethod
The top extension method option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
If used on analytical model that do not support extension, exception InvalidOperationException will be thrown.
To chcek if analytical model support extension use Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.HasExtension
Indicates if the element supports an extension option.
Remarks:
Analytical model elements for walls support extension options, while those for floor or slabs do not.
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.ProjectionPlaneZ
The Z projection option.
Remarks:
Retrieves and set analytical model projection plane information for Z direction.
If analytical model is projected to characteristic location, like center of core, then invalidElementId is returned.
Use ProjectionZ property to determine if analytical model is projected to characteristic location or level, grid or ref plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Plane is invalid projection target.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.ProjectionZ
The Z projection option.
Remarks:
Retrieves and set analytical model projection information for Z direction.
To set projection to level, grid or plane use ProjectionPlaneZ property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.AlignmentMethod
The alignment method option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelSurface
An element that represents a surface in the structural analytical model.
Since:
2013